In [2]:
import pandas as pd

In [18]:
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob', 'David'],
    'Age': [25, 30, 25, 35, 30, 40],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'San Francisco']
}

df = pd.DataFrame(data)
print(df)

duplicates = df[df.duplicated()]

print(duplicates)

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
2    Alice   25       New York
3  Charlie   35        Chicago
4      Bob   30    Los Angeles
5    David   40  San Francisco

In [ ]:
ind = []

dup = df.duplicated()
print(dup) 

o = -1
for i in dup:
    o+=1
    if i==True:
        ind.append(o)
print(ind) 

for i in ind:
    dup1 = df[df['Index']==i]
    print(dup1)

In [36]:
dup_list = []
dup = df.duplicated()
print(dup)

for i in dup:
    dup_list.append(i)
print(dup_list)
print(type(dup_list[0]))
for i in dup_list:
    str(i)
print(type(dup_list[0]))
print(dup_list)

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool
[False, False, True, False, True, False]
<class 'bool'>
<class 'bool'>
[False, False, True, False, True, False]

In [30]:
dup_list = []
dup = df.duplicated()

for i in dup:
    dup_list.append(i)

for i in dup_list:
    str(i)

In [27]:
df['DUP'] = dup_list
print(df)
dup_show = df[df["DUP"] == True]

print(dup_show)

      Name  Age           City    DUP
0    Alice   25       New York  False
1      Bob   30    Los Angeles  False
2    Alice   25       New York  False
3  Charlie   35        Chicago  False
4      Bob   30    Los Angeles  False
5    David   40  San Francisco  False
Empty DataFrame
Columns: [Name, Age, City, DUP]
Index: []